# ***Water Analysis***

> importing modules

In [1]:
import numpy as np
import pandas as pd

> imporing data from excell sheet

In [2]:
data = pd.read_excel("GWQ_2010-2018.xlsx",sheet_name="Sheet1")

### Basic data analysis

In [3]:
data.head()

,SITE_ID,WRIS ID,LATITUDE,LONGITUDE,SITE_TYPE,STATE_NAME,DISTRICT_NAME,TAHSIL_NAME,BLOCK_NAME,SITE_NAME,...,FLUORIDE,SAR,RSC,SiO2,PO4,TDS,Turbidity,%Na,Arsenic,LR. No
0,W115159092441001,W23881,11.866389,92.736111,Dug Well,Andaman And Nicobar,A & N Islands,Ferrargunj,South Andaman,Shoal Bay– 15 No.,...,0.37,NaN,NaN,13.97,NaN,217.748,NaN,NaN,NaN,NaN
1,New,W38814,12.186944,92.791667,Dug Well,Andaman And Nicobar,A & N Islands,Middle Andaman,Baratang Island,South Creek (Sundergarh),...,0.24,0,0,15.14,0,360.745,,,0,0
2,W123014092513301,W24095,12.503889,92.859167,Dug Well,Andaman And Nicobar,A & N Islands,Middle Andaman,Mayabunder,Bakultala,...,0.96,0,0,7.67,0,239.246,NaN,NaN,0,NaN
3,W123129092581301,W24112,12.524722,92.970278,Dug Well,Andaman And Nicobar,A & N Islands,Middle Andaman,Mayabunder,Nimbutala,...,1.02,0,0,0,0,253.22,NaN,NaN,0,NaN
4,W123030092573801,W24098,12.508333,92.960556,Dug Well,Andaman And Nicobar,A & N Islands,Middle Andaman,Mayabunder,Padmanavapuram,...,0.74,0,0,10.34,0,185.361,NaN,NaN,0,NaN

In [4]:
data.count()

SITE_ID           85197
WRIS ID           85197
LATITUDE          84916
LONGITUDE         84916
SITE_TYPE         85197
STATE_NAME        85197
DISTRICT_NAME     85196
TAHSIL_NAME       85085
BLOCK_NAME        85071
SITE_NAME         85197
BASIN_NAME        85197
PROJECT_NAME      85197
year              85197
PH                85193
EC                85194
TH                81780
TOT_ALKALINITY    68788
CA                82060
MG                82049
NA                82056
K                 81988
FE                68575
CARBONATE         79104
BICARBONATE       81973
CHLORIDE          85185
SULPHATE          82060
NITRATE           81056
FLUORIDE          83992
SAR               69351
RSC               67521
SiO2              21338
PO4               22929
TDS               21477
Turbidity          3409
%Na                4025
Arsenic           15535
LR. No            10911
dtype: int64

In [5]:
data.describe()

               year
count  85197.000000
mean    2014.493738
std        2.551327
min     2010.000000
25%     2012.000000
50%     2015.000000
75%     2017.000000
max     2018.000000

In [6]:
data.head()

,SITE_ID,WRIS ID,LATITUDE,LONGITUDE,SITE_TYPE,STATE_NAME,DISTRICT_NAME,TAHSIL_NAME,BLOCK_NAME,SITE_NAME,...,FLUORIDE,SAR,RSC,SiO2,PO4,TDS,Turbidity,%Na,Arsenic,LR. No
0,W115159092441001,W23881,11.866389,92.736111,Dug Well,Andaman And Nicobar,A & N Islands,Ferrargunj,South Andaman,Shoal Bay– 15 No.,...,0.37,NaN,NaN,13.97,NaN,217.748,NaN,NaN,NaN,NaN
1,New,W38814,12.186944,92.791667,Dug Well,Andaman And Nicobar,A & N Islands,Middle Andaman,Baratang Island,South Creek (Sundergarh),...,0.24,0,0,15.14,0,360.745,,,0,0
2,W123014092513301,W24095,12.503889,92.859167,Dug Well,Andaman And Nicobar,A & N Islands,Middle Andaman,Mayabunder,Bakultala,...,0.96,0,0,7.67,0,239.246,NaN,NaN,0,NaN
3,W123129092581301,W24112,12.524722,92.970278,Dug Well,Andaman And Nicobar,A & N Islands,Middle Andaman,Mayabunder,Nimbutala,...,1.02,0,0,0,0,253.22,NaN,NaN,0,NaN
4,W123030092573801,W24098,12.508333,92.960556,Dug Well,Andaman And Nicobar,A & N Islands,Middle Andaman,Mayabunder,Padmanavapuram,...,0.74,0,0,10.34,0,185.361,NaN,NaN,0,NaN

In [7]:
neww_data = data.filter(['PH','EC','TH','TOT_ALKALINITY','FLUORIDE'], axis=1)

In [13]:
neww_data

         PH     EC   TH TOT_ALKALINITY FLUORIDE
0      8.34    355  130            160     0.37
1      8.46    596  120            205     0.24
2      8.11    394  160            155     0.96
3      7.89    448  200            200     1.02
4      8.01    309  125            130     0.74
...     ...    ...  ...            ...      ...
85192  7.83  118.1   60             60        0
85193   7.8    494  125             65     0.05
85194  7.85  480.9  200             55     0.38
85195  8.05  39.46   20             20        0
85196  7.71    530  175            130     0.34

[85197 rows x 5 columns]

# ***Now we have new dataset***

### **Now we will save it and do further analysis with it**

In [91]:
# we will comment it so that it creates ones
# neww_data.to_excel('new_data.xlsx',sheet_name='Sheet1')

In [153]:
new_data = pd.read_excel("new_data.xlsx",sheet_name="Sheet1")
new_data.count()

PH                83673
EC                84838
TH                76260
TOT_ALKALINITY    53287
FLUORIDE          79561
dtype: int64

In [154]:
new_data.head()

     PH     EC     TH  TOT_ALKALINITY FLUORIDE
0  8.34  355.0  130.0           160.0     0.37
1  8.46  596.0  120.0           205.0     0.24
2  8.11  394.0  160.0           155.0     0.96
3  7.89  448.0  200.0           200.0     1.02
4  8.01  309.0  125.0           130.0     0.74

In [155]:
new_data.describe()

                 PH            EC            TH  TOT_ALKALINITY
count  83673.000000  84838.000000  76260.000000    53287.000000
mean       7.960893   1207.479583    318.544059      215.322566
std       24.832844   1551.034260    342.862133      173.485726
min        0.000000      0.000000      0.000000        0.000000
25%        7.580000    450.000000    145.000000      100.000000
50%        7.900000    800.000000    240.192000      190.160000
75%        8.160000   1400.000000    380.000000      300.000000
max     7098.000000  75000.000000  11100.000000     7909.840000

In [156]:
new_data.shape

(85197, 5)

> Now we will drop rows where Fluoride is Na

In [157]:
# new_data = new_data.dropna(subset=["FLUORIDE"])
new_data = new_data.dropna(axis=0)

In [158]:
new_data.shape

(50088, 5)

In [159]:
new_data['PH'].isna().sum()

0

In [160]:
new_data['EC'].isna().sum()

0

In [161]:
new_data['TH'].isna().sum()

0

In [162]:

new_data['TOT_ALKALINITY'].isna().sum()

0

In [163]:
new_data['FLUORIDE'].isna().sum()

0

> **Now we will fill the black cell of features**

In [164]:
# new_data = new_data.assign(PH = new_data['PH'].fillna(new_data['PH'].median))
# new_data['PH'] = new_data['PH'].fillna(new_data['PH'].median)

In [165]:
# new_data = new_data.assign(EC = new_data['EC'].fillna(new_data['EC'].median))
# new_data.loc[:][1] = new_data['EC'].fillna(new_data['EC'].median)

In [166]:
# new_data = new_data.assign(TH = new_data['TH'].fillna(new_data['TH'].median))
# new_data.loc[:][2] = new_data['TH'].fillna(new_data['TH'].median)

In [167]:
# new_data = new_data.assign(TOT_ALKALINITY = new_data['TOT_ALKALINITY'].fillna(new_data['TOT_ALKALINITY'].median))
# new_data.loc[:][3] = new_data['TOT_ALKALINITY'].fillna(new_data['TOT_ALKALINITY'].median)

In [168]:
new_data.count()

PH                50088
EC                50088
TH                50088
TOT_ALKALINITY    50088
FLUORIDE          50088
dtype: int64

# ***Now our data is ready to go further***

In [169]:
# neww_data.to_excel("a.xlsx",sheet_name='Sheet1')

In [183]:
new_data = new_data.astype(float)
# new_data[:][5920:5921]
# new_data.count(axis=0)
# new_data['FLUORIDE'].isna().sum()

In [186]:
correlation_matrix = new_data.corr()

In [187]:
correlation_matrix

                      PH        EC        TH  TOT_ALKALINITY  FLUORIDE
PH              1.000000 -0.000904 -0.001070       -0.003723  0.000924
EC             -0.000904  1.000000  0.807535        0.382506  0.177941
TH             -0.001070  0.807535  1.000000        0.247336  0.069550
TOT_ALKALINITY -0.003723  0.382506  0.247336        1.000000  0.234856
FLUORIDE        0.000924  0.177941  0.069550        0.234856  1.000000

In [188]:
correlation_matrix['FLUORIDE']

PH                0.000924
EC                0.177941
TH                0.069550
TOT_ALKALINITY    0.234856
FLUORIDE          1.000000
Name: FLUORIDE, dtype: float64

In [185]:
new_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 50088 entries, 0 to 85196
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   PH              50088 non-null  float64
 1   EC              50088 non-null  float64
 2   TH              50088 non-null  float64
 3   TOT_ALKALINITY  50088 non-null  float64
 4   FLUORIDE        50088 non-null  float64
dtypes: float64(5)
memory usage: 2.3 MB